//============================================
//
// タイトル:	 CL25課題
// プログラム名: light.h
// 作成者:		 HAL東京ゲーム学科　劉南宏
// 作成日:       2016/11/10
//
//============================================

#ifndef _LIGHT_H_
#define _LIGHT_H_

//============================================
//インクルードファイル
//============================================
#include "main.h"

//============================================
//マクロ定義
//============================================
#define NUM_LIGHT		(3)		// ライトの数

//============================================
//構造体定義
//============================================

class CLight
{
public:

	CLight();
	virtual ~CLight();

	HRESULT Init(void);
	void Uninit(void);


private:
	static D3DLIGHT9 m_aLight[NUM_LIGHT];		// ライト情報

};

#endif
