//============================================
//
// タイトル:	 未来創造展チーム204
// プログラム名: loading.cpp
// 作成者:		 HAL東京ゲーム学科　劉南宏
// 作成日:       2017/01/19
//
//============================================

//============================================
//インクルードファイル
//============================================
#include "main.h"
#include "loading.h"
#include "scene2D.h"

//============================================
// マクロ定義
//============================================
#define TEXTURE_LOGO	"data/TEXTURE/rankS.png"

//============================================
// 静的メンバー変数の初期化
//============================================

//=============================================================================
//コンストラクタ
//=============================================================================
CLoading::CLoading() : CManager(MODE_LOADING)
{

}
//=============================================================================
//デストラクタ
//=============================================================================
CLoading::~CLoading()
{
	
}
//=============================================================================
//
//=============================================================================
HRESULT CLoading::Init(void)
{
	m_fAlpha = 0.0f;
	m_fSpeed = 0.01f;
	m_pLogo = CScene2D::Create( D3DXVECTOR3( SCREEN_WIDTH/2, SCREEN_HEIGHT/2, 0.0f), D3DXVECTOR3( 500.0f, 500.0f, 0.0f), TEXTURE_LOGO);
	m_pLogo->SetColor(WHITE(0.0f));


	return S_OK;
}
//=============================================================================
//
//=============================================================================
void CLoading::Uninit()
{
	CManager::Uninit();
}
//=============================================================================
//
//=============================================================================
void CLoading::Update()
{
	//入力などの更新、各シーンのUpdateの最初に呼び出す
	CManager::Update();

	//アルファ値を変える
	m_fAlpha += m_fSpeed;

	if(m_fAlpha >= 1.0f)
	{
		m_fAlpha = 1.0f;
		m_fSpeed = -m_fSpeed;

		//ゲームデータのロード
		CManager::LoadAllGameData();
	}
	else if(m_fAlpha < 0.0f)
	{
		m_fAlpha = 0.0f;
		SetNextScene(MODE_TITLE);
	}

	//アルファ値を変える
	m_pLogo->SetColor(WHITE(m_fAlpha));

	//シーンが切り替えるところ、各シーンのUpdateの最後に置いとく
	CManager::SceneChange();
}
//=============================================================================
//
//=============================================================================
void CLoading::Draw()
{
	CManager::Draw();
}
