//============================================
//
// タイトル:	 未来創造展チーム204
// プログラム名: loading.h
// 作成者:		 HAL東京ゲーム学科　劉南宏
// 作成日:       2017/01/19
//
//============================================

#ifndef _LOADING_H_
#define _LOADING_H_

//============================================
//インクルードファイル
//============================================
#include "manager.h"

//============================================
//マクロ定義
//============================================

//============================================
//前方宣言
//============================================
class CScene2D;
//============================================
//構造体定義
//============================================

class CLoading : public CManager
{
public:
	CLoading();
	virtual ~CLoading();
	
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	
private:
	CScene2D *m_pLogo;
	float m_fAlpha;
	float m_fSpeed;
};

#endif
