//============================================
//
// タイトル:	 未来創造展チーム204
// プログラム名: meshField.cpp
// 作成者:		 HAL東京ゲーム学科　劉南宏
// 作成日:       2016/12/15
//
//============================================

//============================================
//インクルードファイル
//============================================
#include "main.h"
#include "meshField.h"
#include "renderer.h"
#include "manager.h"

//============================================
// マクロ定義
//============================================

#define TEXTURENAME "data/TEXTURE/field001.jpg"

//============================================
// 静的メンバー変数の初期化
//============================================

//=============================================================================
//コンストラクタ
//=============================================================================
CMeshField::CMeshField()
{

}

//=============================================================================
//デストラクタ
//=============================================================================
CMeshField::~CMeshField()
{
	
}


//=============================================================================
// ポリゴンの初期化処理
//=============================================================================

HRESULT CMeshField::Init(D3DXVECTOR3 pos, D3DXVECTOR3 rot, int nNumBlockX, int nNumBlockZ, float fSizeBlockX, float fSizeBlockZ)
{
	CScene3D::Init( pos, rot, nNumBlockX, nNumBlockZ, fSizeBlockX, fSizeBlockZ, false);

	return S_OK;
}
//=============================================================================
//
//=============================================================================
void CMeshField::Uninit(void)
{
	CScene3D::Uninit();
}
//=============================================================================
//
//=============================================================================
void CMeshField::Update(void)
{
	
}
//=============================================================================
//
//=============================================================================
void CMeshField::Draw(void)
{
	CScene3D::Draw();
}
//=============================================================================
//
//=============================================================================
CMeshField *CMeshField::Create(D3DXVECTOR3 pos, D3DXVECTOR3 rot, int nNumBlockX, int nNumBlockZ, float fSizeBlockX, float fSizeBlockZ)
{
	CMeshField *pMeshField;
	pMeshField = new CMeshField;

	pMeshField->Init(pos, rot, nNumBlockX, nNumBlockZ, fSizeBlockX, fSizeBlockZ);

	////テクスチャの割り当て
	//pMeshField->BindTexture( m_pTexture);

	//テクスチャの読み込み
	pMeshField->Load( TEXTURENAME);

	return pMeshField;
}


////=============================================================================
////
////=============================================================================
//HRESULT CMeshField::Load(void)
//{
//	if( m_pTexture == NULL)
//	{
//		LPDIRECT3DDEVICE9 pDevice;
//		pDevice = CManager::GetRenderer()->GetDevice();
//
//		// テクスチャの読み込み
//		D3DXCreateTextureFromFile( pDevice, TEXTURENAME, &m_pTexture);
//	}
//
//	return S_OK;
//}
//
////=============================================================================
////
////=============================================================================
//void CMeshField::Unload(void)
//{
//	//テクスチャの破棄
//	if( m_pTexture != NULL)
//	{
//		m_pTexture->Release();
//		m_pTexture = NULL;
//	}
//}


