/*******************************************************************************
* タイトル:		timeBg
* プログラム名:	timeBg.h
* 作成者:		小林玲雄
* 作成日:		2016/12/03
*******************************************************************************/
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#ifndef _TIMEBG_H_
#define _TIMEBG_H_
/*******************************************************************************
* インクルードファイル
*******************************************************************************/
#include "main.h"
#include "scene2D.h"
/*******************************************************************************
* マクロ定義
*******************************************************************************/
/*******************************************************************************
* クラス定義
*******************************************************************************/
//クラス宣言
class CTimeBg : public CScene2D
{
public:
	CTimeBg();
	~CTimeBg();
	static CTimeBg* Create(D3DXVECTOR3 pos,D3DXVECTOR3 size,int animPat,int type);
	HRESULT Init(D3DXVECTOR3 pos,D3DXVECTOR3 size,int animPat);
	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	static void SetScl(bool bScl);
private:
	int m_time;
	int m_animPat;
	static bool m_bScl;
};
#endif